packages/Webkul/Admin/src/Http/Controllers/Customer/CustomerController.php

    public function index(): View
    {
        $customers = Customer::with(['lead', 'creator'])->latest()->paginate(15);
---
select * from `customers` order by `created_at` desc limit 15 offset 0
select * from `leads` where `leads`.`id` in (1)
select count(*) as aggregate from `customers`